#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.route53.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ap-northeast-1:554506578892:certificate/06e7b54e-fc23-4c2b-8939-aabde5bbb683]
module.ecr-bot-server.aws_ecr_repository.main: Refreshing state... [id=line-bot-sample2-bot-server]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-00c1771ebed56d7c3]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:cluster/line-bot-sample2]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-057efc7729a90543c]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0b9c9dcab97f3491c]
module.ecs.aws_ecs_task_definition.main: Refreshing state... [id=line-bot-sample2-task-definition]
module.ecr-app.aws_ecr_repository.main: Refreshing state... [id=line-bot-sample2-app]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-006f6db6a24356739]
module.route53.aws_route53_record.validations["line-bot-sample2.moikilo00.net"]: Refreshing state... [id=Z04052072YGY8CIREK2A2__9423f2f8b78ae3bdeb3548f1bea69efa.line-bot-sample2.moikilo00.net._CNAME]
module.route53.aws_acm_certificate_validation.main: Refreshing state... [id=2021-04-27 09:08:01 +0000 UTC]
module.vpc.aws_route_table.privates[1]: Refreshing state... [id=rtb-0a31ed301afa10c9e]
module.vpc.aws_subnet.publics[0]: Refreshing state... [id=subnet-0bb63a2f82ac5687b]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0db9d7fef1d452a9f]
module.vpc.aws_subnet.publics[1]: Refreshing state... [id=subnet-0a3c585bbf6bba58b]
module.alb.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/line-bot-sample2-target-group/58a5d2c401d24345]
module.vpc.aws_subnet.privates[0]: Refreshing state... [id=subnet-0d00944d99dfe3fb9]
module.vpc.aws_route_table.privates[0]: Refreshing state... [id=rtb-0b7249501f7f39f80]
module.vpc.aws_subnet.publics[2]: Refreshing state... [id=subnet-03c288199d18a8e45]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0833e5cbb3feed7c4]
module.vpc.aws_route_table.privates[2]: Refreshing state... [id=rtb-0f70a7f400318b4fa]
module.vpc.aws_subnet.privates[1]: Refreshing state... [id=subnet-071a11b51c485b0b1]
module.vpc.aws_subnet.privates[2]: Refreshing state... [id=subnet-02c271aaae088ea4b]
module.alb.aws_security_group.alb: Refreshing state... [id=sg-0c8dcd04363bd0392]
module.ecs.aws_security_group.ecs: Refreshing state... [id=sg-0b735eb115d0a7f67]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-0833e5cbb3feed7c41080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dfdb12fab7d4006a]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-03b3ab2a2914b0263]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f51279304586a58e]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05e859eb1301e09d1]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-08ad602944b29d19c]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0f4ea87184c0c52ae]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/line-bot-sample2/b6ec22dc4a4a0855]
module.vpc.aws_route_table_association.privates[1]: Refreshing state... [id=rtbassoc-0a74d87da37cd4c32]
module.vpc.aws_route_table_association.privates[2]: Refreshing state... [id=rtbassoc-0c7b9baba708642b6]
module.vpc.aws_route_table_association.privates[0]: Refreshing state... [id=rtbassoc-0840d58339cd83f90]
module.vpc.aws_route.privates[1]: Refreshing state... [id=r-rtb-0a31ed301afa10c9e1080289494]
module.vpc.aws_route.privates[2]: Refreshing state... [id=r-rtb-0f70a7f400318b4fa1080289494]
module.vpc.aws_route.privates[0]: Refreshing state... [id=r-rtb-0b7249501f7f39f801080289494]
module.ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:service/line-bot-sample2/line-bot-sample2]
module.route53.aws_route53_record.main: Refreshing state... [id=Z04052072YGY8CIREK2A2_line-bot-sample2.moikilo00.net_A]
module.alb.aws_lb_listener.http_to_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/b6ec22dc4a4a0855/3f84b7d5f573be07]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/b6ec22dc4a4a0855/2cb98019d76373f2]
module.alb.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener-rule/app/line-bot-sample2/b6ec22dc4a4a0855/2cb98019d76373f2/d1324bf69f8e5783]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ap-northeast-1:554506578892:service/line-bot-sample2/line-bot-sample2"
        name                               = "line-bot-sample2"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:554506578892:task-definition/line-bot-sample2-task-definition:2" -> (known after apply)
        # (13 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:554506578892:task-definition/line-bot-sample2-task-definition:2" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu          = 0 -> null
                  - environment  = [] -> null
                  - essential    = true -> null
                  ~ image        = "nginx:latest" -> "554506578892.dkr.ecr.ap-northeast-1.amazonaws.com/line-bot-sample2-app:0.0.1-75b03b2"
                  - mountPoints  = [] -> null
                  ~ name         = "nginx" -> "linebot-sample2-hello-app"
                  ~ portMappings = [
                      ~ {
                          ~ containerPort = 80 -> 8080
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom  = [] -> null
                } # forces replacement,
            ]
        )
      ~ id                       = "line-bot-sample2-task-definition" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @lazmond3, Action: `pull_request`*